[
	{
		"pubDate": "Tue, 13 Jun 2006 22:52:50 -04:00",
		"content": "<p>im in singapore.<\/p><p>its actually not as hot as i remembered.<\/p><p>maybe thats because it rained.<\/p><p>MAYBE.<\/p><p>stupid myspace isnt working right now.<\/p><p>and theres this person who wants to be my friend but i cant check it out cos myspace isnt working and i think i know at least ten ppl with the same name.<\/p><p>i should be happy. im on vacation. no more school.<\/p><p>aim isnt working either.<\/p><p>T.T<\/p>",
		"post_date": "2006-06-13 22:52:50",
		"post_date_gmt": "2006-06-14 02:52:50"
	},
	{
		"pubDate": "Thu, 04 May 2006 03:48:48 -04:00",
		"content": "<p>wow.<\/p><p>i havent gotten this many eprops and comments in a loooooooooooooong time. i feel so special *sniffs*. as per usual im being weird&mldr; its not like my updates are all that interesting anyways&mldr; <\/p><p>sleepy&mldr; <\/p><p>must&mldr; go&mldr; to&mldr; bed&mldr; <\/p>",
		"post_date": "2006-05-04 03:48:48",
		"post_date_gmt": "2006-05-04 07:48:48"
	},
	{
		"pubDate": "Sun, 30 Apr 2006 18:16:35 -04:00",
		"content": "<p>that mandarin speech contest was interesting. i had victoria szeto and hippo in my division. victoria, of course, won. i wasnt expecting to win anyways (well maybe a little but that was cos i didnt know that they took out second and third place). that was my first time and i was unprepared. well maybe next time.<\/p><p>omg im so tired out from talking to victoria so much&mldr; i dunno i guess i dont last very long&mldr; but i havent seen her for ages so it was sooper cool seeing her again. yep&mldr; <\/p>",
		"post_date": "2006-04-30 18:16:35",
		"post_date_gmt": "2006-04-30 22:16:35",
		"comment": [
			{
				"comment_content": "hey gooberz mee too!!! meesa hafent seen viki in a LOOONG LOOOONG LOOOONG time! ^_^",
				"comment_date": "2006-05-01 19:57:00",
				"comment_date_gmt": "2006-05-01 23:57:00",
				"comment_author": "h1dd3ndarkn3ss"
			},
			{
				"comment_content": "<p>ooo the chinese classes at my school went to a speech contest&mldr; we won 10 awards!..unfortunately i&rsquo;m in chinese 1. w00t.<\/p><p>w00t mont<strong><u>A<\/u><\/strong> vista.<\/p><p>lol i heard you saw the other gaby&rsquo;s xanga.<\/p>",
				"comment_date": "2006-05-01 20:58:00",
				"comment_date_gmt": "2006-05-02 00:58:00",
				"comment_author": "thelittobluehippo"
			}
		]
	},
	{
		"pubDate": "Thu, 20 Apr 2006 23:13:15 -04:00",
		"content": "<p>im huuuuuuuuuuuuuunnnnnnnnnnnnnnnnngggggggggggggrrrrrrrrrrrrrryyyyyyyyyyy.<\/p><p>i dunno if it posted yet cos my coms weird, but i said that already. o, well.<\/p>",
		"post_date": "2006-04-20 23:13:15",
		"post_date_gmt": "2006-04-21 03:13:15",
		"comment": [
			{
				"comment_content": "<p>poor gooberz. .-.<\/p><p>well&mldr; don&rsquo;t just sit here and type. Git something to eat!!!! XD u won&rsquo;t have any progress thru life by just complaining. XP<\/p><p>~Jo<\/p>",
				"comment_date": "2006-04-23 23:18:00",
				"comment_date_gmt": "2006-04-24 03:18:00",
				"comment_author": "Kiriku"
			},
			{
				"comment_content": {
					"__cdata": "yeh i will!"
				},
				"comment_date": "2006-04-25 01:09:00",
				"comment_date_gmt": "2006-04-25 05:09:00",
				"comment_author": "gabbriell"
			}
		]
	},
	{
		"pubDate": "Thu, 20 Apr 2006 23:08:26 -04:00",
		"content": "<p>hi.<\/p><p>im huuuuuuuuuuuuuuuuuuuunnnnnnnnnnnnnnnnngggggggggggggrrrrrrrrrrrrrrryyyyyyyyyyy.<\/p><p>my stomach is crying out for food.<\/p><p>i will go and quiet it down a bit.<\/p>",
		"post_date": "2006-04-20 23:08:26",
		"post_date_gmt": "2006-04-21 03:08:26"
	},
	{
		"pubDate": "Tue, 11 Apr 2006 21:10:23 -04:00",
		"content": "<p>this is my one hundred and eleventh day of being a member of xanga. at least, on this account.<\/p><p>i really should update more (like certain people insist) but why bother?<\/p><p>so&mldr; <\/p><p>spring break&mldr; <\/p><p>or as ccs calls it, easter vacation&mldr; <\/p><p>did you know people have taken to calling the easter bunny &ldquo;the spring bunny&rdquo;? thats just sad. they have to take god outta everything. and easter wasnt even originally christian! it was PAGAN!<\/p><p>okay, had my little rant for the day&mldr; <\/p><p>anyways, spring break has its ups&mldr; <\/p><p>and its downs&mldr; <\/p><p>the downs (being their annoying selves) came first.<\/p><p>day 1/2 (friday): goes to tahoe with ichthus. comes down with a raging fever and insatiable thirst. pigs out on candy, then gets more sick.<\/p><p>day 1:  plays soccer in the snow. makes cards for guys appreciation. comes down with blistering cold. goes to the cabin early and sleeps while everyone else, oblivious to any of this, screams at the tops of their voices. no, not at the cabin, at the OTHER cabin. watches princess bride with michaela twince in a row (hey, its a good movie! well except for that short guy going, &ldquo;inconceivable! INCONCEIVABLE!&rdquo; inconceivable, my butt)<\/p><p>day 2: allergy attack. arrives home a mess (and a dirty mess, to boot). goes to sleep vvvvveeeeeeeerrrrrrryyyyy late.<\/p><p>day 3: virtuously sets about to try to complete homework. fails. does nothing for the rest of the day.<\/p><p>and now&mldr; <\/p><p>im doing NOTHING.<\/p><p>well, okay, im typing and im sitting and im breathing AND blinking at the same time (amazing, isnt it) and other crap but nothing really.<\/p><p>so&mldr; <\/p><p>i will go do something more productive with my time.<\/p><p>i think ill take a nap.<\/p>",
		"post_date": "2006-04-11 21:10:23",
		"post_date_gmt": "2006-04-12 01:10:23"
	},
	{
		"pubDate": "Fri, 10 Mar 2006 23:45:31 -05:00",
		"content": "<p>we made tshirts at jojos house today!!! they look freakishly awesome.<\/p><p>&ldquo;wow, your tshirt looks&mldr; so..so <em>real<\/em>.&rdquo; i quote directly from my friends.<\/p><p>rias shirts gonna be the same as mines except that hers is gonna say &ldquo;mojo&rdquo; steada &ldquo;goober&rdquo; and &ldquo;38&rdquo; steada &ldquo;22&rdquo;.<\/p><p>haivin so much fun!!!!!!!!!!!!!!!!<\/p><p>d=(^.^)z<\/p>",
		"post_date": "2006-03-10 23:45:31",
		"post_date_gmt": "2006-03-11 04:45:31"
	},
	{
		"pubDate": "Fri, 24 Feb 2006 21:05:48 -05:00",
		"content": "haha me and my sister (there goes the grammar) went to the dentist today. my teeth were almost perfect, just a little gingivitis or however you spell it. no braces for me!!! ^.^ my sister wasnt so lucky. she has another cavity AND her bite is weird AND her teeth are too big so now she has to go to a orthodontist. poor girl. i feel for her. i think.",
		"post_date": "2006-02-24 21:05:48",
		"post_date_gmt": "2006-02-25 02:05:48"
	},
	{
		"pubDate": "Wed, 22 Feb 2006 00:14:11 -05:00",
		"content": "<p>well&mldr; <\/p><p>i just found out what a stupid unintelligent fool i am.<\/p><p>i have gotten Ds and Fs on ALL the quizzes on a tale of two cities.<\/p><p>Ds and Fs.<\/p><p>thank god my parents dont check powerschool, or i might be decapitated *shudders* with a kitchen cleaver or something. dont know about you, but i would prefer something somewhat on the extremely sharp side if i wanted to be decapitated.<\/p><p>i was remarking to a friend today that my parental units must have somehow malfunctioned while attempting to program the right time to pick their children up. school ends at 3.40. it does not end at 4.30. however, i was sadly mistaken. they actually do know the correct time (SHOCK). my parental units had been delayed by a somewhat dense client of theirs who simply did not understand the simple words I NEED TO GO PICK MY CHILDREN UP. how dense can you get? i mean, my father stood up and made motions to leave, but no, no, she just had to stay a little longer and explain her whole life story. i simply do not understand these people. do they not understand that people actually do other things besides listen to them talk about themselves? really. some people need to grow up *coughs to self*.<\/p><p>i was proofreading another friend&rsquo;s essay last week when i discovered why aim is bad for you. this poor girl has simply had more aim than is healthy. &ldquo;u&rdquo;s and &ldquo;b4&rdquo;s were lttered throughout her essay, as well as the occasional &ldquo;um&mldr; &rdquo;. i do not mean to insult her. but look at what im (and every other internet service) is doing. it has utterly destroyed what little vocabulary the highschoolers of today currently possess. well, excepting a few nerds here and there. *sighs* i&rsquo;m fighting a losing battle here. best give up while i&rsquo;m still behind.<\/p>",
		"post_date": "2006-02-22 00:14:11",
		"post_date_gmt": "2006-02-22 05:14:11"
	},
	{
		"pubDate": "Sat, 18 Feb 2006 21:10:04 -05:00",
		"content": "<p>yay!!! i can FINALLY post on my xanga using my asininely SLOW computer!!! wait, is asininely a word? o.O i havent been thinking straight for about a week and a half now, i think its a new record.<\/p><p>i also wrote a very interesting essay&mldr; <\/p><p>Chills ran down my spine as I looked out my bedroom window one bright, sunny morning. No, I did not shudder at any of the usual yappy little dogs or the ghastly overweight specters that are commonly called raccoons. Fortunately, neither of these horrible creatures was currently skulking around my neighborhood. But I digress from my tale of woe. I will continue. I did not shudder at the disgusting waste from the construction site on our hill. Nor did I shudder at the disgusting waste that the deer made while consuming what cannot currently be called a garden. No, I shuddered at the sun. That bright, shiny, fiery red ball in the sky that supposedly bestows heat and light upon us poor needy humans. I could appreciate the light. There was plenty of light (maybe a little too much). What I could not appreciate was the heat, because there was simply no heat at all. The sun was only doing one of its jobs! I glared at the sun. It was definitely mocking me. Its very presence betrayed the glee it must have felt at torturing poor, innocent people by giving light without heat. Sure, one or two days of sharp, icy mornings, boiling hot afternoons, and deathly chilly nights is fine with me. I mean, we humans can survive with feverish heads and bodies that feel dead for a while. Our bodies can take the ever-so-constant temperatures. Well, at least for some reasonable amount of time. But for us to live like this for five straight days? I think not. After all, one&rsquo;s body can only take so much torture. One&rsquo;s body can only freeze so much while it is still trying to boil itself. One&rsquo;s body can only suffer one malady at a time (i.e. I cannot have heatstroke and frostbite at the same time). I do not think the elements of nature quite understand that I can only take so much anguish before I die of what shall henceforth be known to all as &ldquo;frost-stroke.&rdquo; Do not confuse the meaning of my words. I do not mean to actually blame the weather. After all, it is only human, right?<\/p><p>Many students at Chinese Christian Schools may not have noticed that I wear a skort to school. Skorts are the best things that ever happened to school uniform. Not only are they comfortable, but they also are easy and light to run in when one has conveniently forgotten one&rsquo;s gym clothes (as opposed to those skirts that do not have handy little shorts underneath for when you&rsquo;re running in windy conditions or those pants with abnormal cuts that never quite fit the legs of your average teenage girl). However, I have one little issue with those fantastic bottoms. Skorts do not keep your legs from freezing over on one of those glorious, cold, and very windy days. They do not shield your poor, innocent limbs from the ever harsh rain, nor do they prevent a good game of &ldquo;hey-let&rsquo;s-splash-mud-on-the-sophomore.&rdquo; So when I finally convinced myself to get out of bed that fateful morn, what was the first thing I did? I pulled on my handy dandy skort! Thanks to my dear sibling, I no longer have a pair of presentable uniform khaki pants (unless you count the one that I fit three years ago). So on goes the skort. On I go to another day of temperature extremities.<\/p><p>As soon as I returned to the torture teachers lovingly refer to as school for another six hours of trying to focus on my studies, I realized that I had forgotten one thing. This particular object of which I speak was vital to my existence. Dare you laugh? I had conveniently left my pencil somewhere that was so safe that even I could not locate it. I scrounged around in my backpack, hoping to recover some long-forgotten stick of wood that I could use to finish the last geometric proof for my homework assignment. I finally discovered that I had left the pencil in my pocket (I had been wondering what had been poking me ever so persistently). I thank God for small wonders in life such as that. I furiously scribbled illegible marks on my homework paper, trying to figure out why sixty is not divisible by eleven. Thankfully, I was relieved of such ponderings by a classmate of mine who kindly pointed out that I had multiplied six and ten instead of six and four, and that I need not divide by eleven in the first place. &ldquo;Gee&rdquo; was the word that I so eloquently used to express my frustration at my brain&rsquo;s sudden idiocy. &ldquo;I&rsquo;m so smart that I&rsquo;m stupid.&rdquo; I angrily packed up my books and headed out the door. The emotions I felt were so strong that I could not even speak coherently until fifteen minutes had passed. And as I walked out the door, I heard my helpful classmate cheerfully say, &ldquo;At least the sun&rsquo;s still shining.&rdquo;<\/p><p>i sound so strange. in fact, i had to change some of the words for fear of being mocked.<\/p><p>well, i probably will be mocked anyway.<\/p><p>well thats normal for me&mldr; <\/p><p>ill just hope that the teacher wont read it out loud in class again. that would embarress me to no end.<\/p><p>wow, thats the longest post ive ever written.<\/p><p>im sorry for those of you who dont like to read long posts, i know how it feels to scroll down like fifty pages of teeny tiny font that goes on forever. i especially hate it when people attempt to sound idiotic (and failing even there) by using abnormal speech (such examples can be found right <a href='http://www.xanga.com/laminatedbunny' target='_new'>here<\/A>.<\/p><p>farewell strange strangers.<\/p>",
		"post_date": "2006-02-18 21:10:04",
		"post_date_gmt": "2006-02-19 02:10:04"
	},
	{
		"pubDate": "Mon, 06 Feb 2006 23:31:04 -05:00",
		"content": "<p>you know what? well, you probably dont, but <em>anyways<\/em>&mldr; <\/p><p>all i ever write on either of my xangas is DEPRESSING BORING SLIGHTLY INSANE information that no one needs to know.<\/p><p>*sighs*<\/p><p>on my aim away message&mldr; <\/p><p>&ldquo;i am currently decapitating myself and/or cutting off my ears. please leave me to my self-mutilation. thank you.&rdquo;<\/p><p>i mean, what the heck was i thinking?<\/p><p>aah, what the freak, ima be too lazy to change it&mldr; <\/p><p>:) what a wonderful world.<\/p>",
		"post_date": "2006-02-06 23:31:04",
		"post_date_gmt": "2006-02-07 04:31:04",
		"comment": [
			{
				"comment_content": "<p>my computer is so disgustingly annoying. i am reduced to adding a comment to this strange post so that i can actually update. what do i have to say, anyways? i have no idea. well, not counting my study sheets&mldr; <\/p><p>jeez, whats so awesomely freakish about them?<\/p><p>all i did was squeeze few chapters of my history book into one page.<\/p><p>okay, it does sound a little weird, but it helps, and its not THAT hard.<\/p><p>fine, i conceds. it is awesomely freakish.<\/p><p>for those of you who have actually seen those papers&mldr; <\/p><p>ARE YOU HAPPY NOW??<\/p><p>wait&mldr; i didnt mean to sound mad&mldr; <\/p><p>did i?<\/p>",
				"comment_date": "2006-02-07 21:34:00",
				"comment_date_gmt": "2006-02-08 02:34:00",
				"comment_author": "gabbriell"
			},
			{
				"comment_content": "<p>*sigh* another spelling mistake. *concede, not conceds.<\/p>",
				"comment_date": "2006-02-07 21:35:00",
				"comment_date_gmt": "2006-02-08 02:35:00",
				"comment_author": "gabbriell"
			},
			{
				"comment_content": "hahaha. Gabrielle , you&rsquo;re so clever. :D Love your away message. I would have never thought of something like that.",
				"comment_date": "2006-02-11 00:51:00",
				"comment_date_gmt": "2006-02-11 05:51:00",
				"comment_author": "laminatedbunny"
			}
		]
	},
	{
		"pubDate": "Mon, 06 Feb 2006 01:34:32 -05:00",
		"content": "<p>i dont know why i use xanga.<\/p><p>after all, i havent even updated in like forever.<\/p><p>all i do is mess with the layout.<\/p><p>im such a weird person, wouldnt you agree?<\/p><p>depressing.<\/p>",
		"post_date": "2006-02-06 01:34:32",
		"post_date_gmt": "2006-02-06 06:34:32",
		"comment": [
			{
				"comment_content": "Hey, your not weird, thats all I did at first on my xanga. XD Its just apart of the boredom in human nature, so don&rsquo;t think you&rsquo;re weird, you&rsquo;re normal&mldr; its just everyone is weird in thier own special way&mldr; ",
				"comment_date": "2006-02-06 22:28:00",
				"comment_date_gmt": "2006-02-07 03:28:00",
				"comment_author": "Bakudom"
			},
			{
				"comment_content": "hey gabriel! just droppin&rsquo; in to say hi =)",
				"comment_date": "2006-02-07 10:31:00",
				"comment_date_gmt": "2006-02-07 15:31:00",
				"comment_author": "cindyandmary"
			}
		]
	},
	{
		"pubDate": "Mon, 02 Jan 2006 21:29:07 -05:00",
		"content": "<p>its so&mldr; so misspelled.<\/p><p>i thought, &ldquo;geez, i cant remember the stupid usernames i make up, im just going to make a new xanga with my real name and be done with it.&rdquo;<\/p><p>sounds easy?<\/p><p>well, maybe for you.<\/p><p>so anyways, when i was filling in those thingies (the name escapes me) for getting a xanga, i thought, &ldquo;well now, theres bound to be hundreds of gabrielles in this world&mldr; i think ill spell it funny just for the heck of it. like i accidentally did on my homework.&rdquo;<\/p><p>gabbriell?<\/p><p>so&mldr; at least i can vaguely remember what my xanga is currently called.<\/p><p>whenever anyone asks for the name of my xanga, i can safely say that it goes along the lines of &ldquo;gabrielle&rdquo;.<\/p><p>&ldquo;gabriell&rdquo;?<\/p><p>or &ldquo;gabbrielle&rdquo;?<\/p><p>or maybe &ldquo;goober&rdquo;&mldr; &ldquo;gai bei&rdquo;?<\/p><p>hopefully, i will remember to use somewhat proper grammar and spelling. sorry, for those people who care, i will not be using apostrophes or proper capitalization. im just too lazy. most people will probably agree with me that it is easier not to press the shift key or the apostrophe key so often. my internet grammar and spelling havent spilled into my essays yet, so i think im pretty safe.<\/p><p>i think i digressed far too many times. yay, i used a somewhat big word out of my extensive, spelling bee winner, but currently dead vocabulary!<\/p><p>wait&mldr; does that make sense? o.O<\/p><p>joy. sheer bliss.<\/p>",
		"post_date": "2005-12-30 02:04:09",
		"post_date_gmt": "2005-12-30 07:04:09"
	},
	{
		"pubDate": "Mon, 02 Jan 2006 21:41:58 -05:00",
		"content": "<p>i have a new xanga.<\/p><p>for those of you who actually read the thing.<\/p><p>its <a href='http://www.xanga.com/gabbriell' target='_new'>gabbriell<\/a>. yeh&mldr; <\/p><p>so&mldr; for more details, please click on the link.<\/p><p>bie.<\/p>",
		"post_date": "2006-01-02 21:41:58",
		"post_date_gmt": "2006-01-03 02:41:58"
	},
	{
		"pubDate": "Sat, 05 Nov 2005 15:57:23 -04:00",
		"content": "<p>so&mldr; tired&mldr; <\/p><p>*sighs* yesterday was super cool&mldr; the xc ppl got to skip half of school cause of the league finals&mldr; and varsity girls got third!!! nicole scared me, she said that we were two points a way from fourth, paused to let it sink in, and THEN she said we got third. for a minute there my heart stopped! i mean, the varsity girls are GREAT (except for me)!<\/p><p>then on a whim maria came with me to ichthus while her parents were waiting at SCHOOL cause they thought she said she was going to lc! ah well, at least we got that sorted out&mldr; <\/p><p>fare thee well.<\/p>",
		"post_date": "2005-11-05 15:57:23",
		"post_date_gmt": "2005-11-05 20:57:23",
		"comment": [
			{
				"comment_content": "What do you mean &ldquo;except for me&rdquo;, Gabrielle? We ALL did well. =]",
				"comment_date": "2005-11-05 17:57:00",
				"comment_date_gmt": "2005-11-05 22:57:00",
				"comment_author": "laminatedbunny"
			},
			{
				"comment_content": "yeah!! you DID do well! ^-^",
				"comment_date": "2005-11-06 13:16:00",
				"comment_date_gmt": "2005-11-06 18:16:00",
				"comment_author": "Anonymous"
			},
			{
				"comment_content": "well i know i did but i can&rsquo;t shake the feeling that i didn&rsquo;t!",
				"comment_date": "2005-11-06 18:04:00",
				"comment_date_gmt": "2005-11-06 23:04:00",
				"comment_author": "eiRiaN_sTaR"
			}
		]
	},
	{
		"pubDate": "Thu, 03 Nov 2005 19:50:01 -04:00",
		"content": "<p>&ldquo;you disgust me, all of you, you and your happiness! and your life, that has to be loved at any price. you&rsquo;re like dogs fawning on everyone they come across. with just a little hope left every day - if you don&rsquo;t expect too much. but i want everything, now! and to the full! or else i decline the offer, lock, stock, and barrel! i don&rsquo;t want to be sensible, and satisfied with a scrap - if i behave myself! i want to be sure of having everything, now, this very day, and it had to be as wonderful as it was when i was little. otherwise i prefer to die.&rdquo; -quoted from <em>antigone<\/em> by jean anouilh<\/p><p>lovely huh?<\/p><p>though this person had some guts to stand up to someone who could destroy her and everyone she loved.<\/p><p>*sighs* i feel depressed&mldr; <\/p>",
		"post_date": "2005-11-03 19:50:01",
		"post_date_gmt": "2005-11-04 00:50:01"
	},
	{
		"pubDate": "Thu, 27 Oct 2005 22:25:02 -04:00",
		"content": "<p>so&mldr; i was reading my posts&mldr; <\/p><p>and i am so whiney<\/p><p>that its depressing.<\/p><p>so i&rsquo;ve promised myself that the few special times that i write in my xanga&mldr; <\/p><p>not that their special&mldr; <\/p><p>i WILL sound cheerful.<\/p><p>i WILL sound cheerful.<\/p><p>nah, not working.<\/p><p>o well at least i&rsquo;m not complaining like SOMBODY I KNOW&mldr; *nudges the hippo*.<\/p><p>but seriously.<\/p><p>so&mldr; <\/p><p>during xc practice i tripped and fell on that stupid knee again AND i got blisters. the ground seriously hates me. i don&rsquo;t even know why i do xc. but i guess i&rsquo;m just a sucker for punishment, i just run. cant live without it.<\/p><p>well thank you for reading this little episode of my so-called life, so sorry for boring you. i will be taking my leave.<\/p>",
		"post_date": "2005-10-27 22:25:02",
		"post_date_gmt": "2005-10-28 02:25:02",
		"comment": {
			"comment_content": "Hope your knee feels better, Gabrielle. ^_^",
			"comment_date": "2005-10-27 23:32:00",
			"comment_date_gmt": "2005-10-28 03:32:00",
			"comment_author": "laminatedbunny"
		}
	},
	{
		"pubDate": "Sun, 02 Oct 2005 19:44:46 -04:00",
		"content": "<p>half moon bay yesterday was so much fun!! except for the stupid seagull&mldr; nancy and maria and i were burying ourselves in the sand and i asked them &ldquo;wouldnt it be funny if we were completely buried an then a seagull came and stared at us and we couldnt get rid of it?&rdquo; well just guess what happened&mldr; the seagull actually came over right when we had just finished burying ourselves and it wouldnt go away!!! omg i will never ever use those words &ldquo;wouldnt it be funny if&mldr; &rdquo;. it really is not funny.<\/p><p>well anyways i did better at the race then i thought i would do except for that one hill that killed my legs&mldr; well it isnt as big as dat one at lake chabot but it was still pretty evil.<\/p><p>yeah&mldr; did some stuf on <a href='http://www.xanga.com/DrAgOnZkIdDoZ' target='_new'>tiffoz site<\/a>&mldr; it looks pretty good but i think i&rsquo;m gonna put some more&mldr; i wish the html wasnt so hard to do&mldr; <\/p><p>record dicovery of the day: there is no such thing as &ldquo;neat&rdquo; handwriting when your riding on a school bus&mldr; <\/p><p>took me about an hour to discover that one&mldr; <\/p><p>&mldr; <\/p>",
		"post_date": "2005-10-02 19:44:46",
		"post_date_gmt": "2005-10-02 23:44:46",
		"comment": [
			{
				"comment_content": "<p>Gabby! i didn&rsquo;t get the chance to say hi to you yesterday! i hope you&rsquo;re doing well! you should I.M me sometime on AIM. here&rsquo;s my screenname: glowinglilstarz. well, hopefully i&rsquo;ll see you this coming up Sunday! take care now..<\/p><p>--Winnie.<\/p>",
				"comment_date": "2005-10-18 02:00:00",
				"comment_date_gmt": "2005-10-18 06:00:00",
				"comment_author": "dArKbRoWnEyEs"
			},
			{
				"comment_content": "haha i was reading your little.. i dont know what do you call them. anyhow, i thought of this: \"hahaha i gave gabby two hippos..\" :)",
				"comment_date": "2005-10-18 02:04:00",
				"comment_date_gmt": "2005-10-18 06:04:00",
				"comment_author": "dArKbRoWnEyEs"
			}
		]
	},
	{
		"pubDate": "Thu, 15 Sep 2005 18:10:52 -04:00",
		"content": "<p>umm&mldr; <\/p><p>if anyone has any idea of how to find an art show in the bay area that i can actually find some information for to write about in the school newspaper&mldr; <\/p><p>PLEASE TELL ME&mldr; <\/p><p>i am having some serious difficulties&mldr; <\/p><p>but then isnt my life just about misery?<\/p><p>*sigh*<\/p><p>i sound like such a brat&mldr; <\/p><p>well please help if possible&mldr; <\/p>",
		"post_date": "2005-09-15 18:10:52",
		"post_date_gmt": "2005-09-15 22:10:52"
	},
	{
		"pubDate": "Sat, 03 Sep 2005 22:36:36 -04:00",
		"content": "<p>yaar&mldr; <\/p><p>dont&mldr; like&mldr; intervals&mldr; <\/p><p>&mldr; <\/p><p>i tripped and fell..<\/p><p>a big patch of raw flesh on my knee&mldr; <\/p><p>blood running down my leg&mldr; <\/p><p>it didnt hurt <em>quite<\/em> as much as it looked like&mldr; <\/p><p>nevertheless&mldr; <\/p><p>i hafta hobble around&mldr; <\/p><p>bleh.<\/p>",
		"post_date": "2005-09-03 22:36:36",
		"post_date_gmt": "2005-09-04 02:36:36",
		"comment": {
			"comment_content": "whee! Intervals are fun! =D hehe. This is Jenny.",
			"comment_date": "2005-09-05 01:23:00",
			"comment_date_gmt": "2005-09-05 05:23:00"
		}
	},
	{
		"pubDate": "Wed, 24 Aug 2005 15:46:57 -04:00",
		"content": "<p>happy birthday to me!!! 😂 todays nothing special&mldr; but at least i&rsquo;m older&mldr; <\/p>",
		"post_date": "2005-08-24 15:46:57",
		"post_date_gmt": "2005-08-24 19:46:57",
		"comment": [
			{
				"comment_content": "*throws confetti*  =]",
				"comment_date": "2005-08-24 19:30:00",
				"comment_date_gmt": "2005-08-24 23:30:00",
				"comment_author": "Kiriku"
			},
			{
				"comment_content": "OHMYGAH OHMYGAH OHMYGAH OHMYGAH OHMYGAH OHMYGAH OHMYGAH OHMYGAH  is this the GABBBBBBY FROM CBM CAMP??!!",
				"comment_date": "2005-08-29 00:56:00",
				"comment_date_gmt": "2005-08-29 04:56:00",
				"comment_author": "thelittobluehippo"
			},
			{
				"comment_content": "oh yea, happy birthday my dear.",
				"comment_date": "2005-08-29 00:58:00",
				"comment_date_gmt": "2005-08-29 04:58:00",
				"comment_author": "thelittobluehippo"
			},
			{
				"comment_content": "<p>GABBY!!!!!!! i found through the icthus blogring!! well.. happy belated birthday again.. hehehe how have you been doing lately?<\/p><p>--Winnie.<\/p>",
				"comment_date": "2005-08-30 21:39:00",
				"comment_date_gmt": "2005-08-31 01:39:00",
				"comment_author": "dArKbRoWnEyEs"
			}
		]
	},
	{
		"pubDate": "Sun, 02 Oct 2005 19:25:22 -04:00",
		"content": "<p>well&mldr; <\/p><p>tommorow&rsquo;s my birthday&mldr; <\/p><p>i&rsquo;m such a loser&mldr; <\/p><p>i&rsquo;m doing NOTHING&mldr; <\/p><p>well, except going to karate&mldr; <\/p><p>but i do that every wednesday&mldr; <\/p><p>i&rsquo;m depressed now&mldr; <\/p><p>well at least i finally uploaded my pics on my other <a target='_new' href='http://www.xanga.com/silver_light_00'>site<\/a>&mldr; <\/p><p>but the background makes it look like there&rsquo;s huge weird white zits on everyone&rsquo;s faces&mldr; <\/p><p>and i still have more to upload&mldr; <\/p><p>how depressing&mldr; <\/p><p>i used the same word twice&mldr; <\/p><p>how depressing&mldr; <\/p>",
		"post_date": "2005-08-23 15:31:46",
		"post_date_gmt": "2005-08-23 19:31:46"
	},
	{
		"pubDate": "Mon, 22 Aug 2005 17:32:04 -04:00",
		"content": "<p>since pics take up so much room and i have soooooooo many i wanna show, i made up a new xanga for them&mldr; <a href='http://www.xanga.com/silver_light_00' target='_new'>silver_light_00<\/a>&mldr; well&mldr; there should be pictures there EVENTUALLY&mldr; <\/p><p>&mldr; <\/p><p>&mldr; <\/p><p>bye!<\/p>",
		"post_date": "2005-08-22 17:32:04",
		"post_date_gmt": "2005-08-22 21:32:04"
	},
	{
		"pubDate": "Mon, 15 Aug 2005 19:27:11 -04:00",
		"content": "<p>well&mldr; back&mldr; frm&mldr; cbm&mldr; so..tired&mldr; zzz&mldr; anyways&mldr; anyone wanna see pics? too late, i&rsquo;m showing them&mldr; <\/p><p><img src='http://www.geocities.com/eirian_star/img_3448.JPG'/><\/p><p>a pic of mabel messing with MY needle and a sponge (god alone knows why)&mldr; <\/p><p><img src='http://www.geocities.com/eirian_star/img_3450.JPG'/><\/p><p>jeff making a hole in his bottle cap with MY needle (again, god alone knows why)&mldr; <\/p><p><img src='http://www.geocities.com/eirian_star/img_3460.JPG'/><\/p><p>and a grand finale of jeff counting salt grains on his nametag&mldr; <\/p><p>well these are pretty funny though pretty weird&mldr; <\/p><p>too lazy to upload more pics so i&rsquo;ll do it later&mldr; <\/p><p>oh yes, for those few who subscribe to me - i found mistakes that i had to fix and i&rsquo;m not sure if they send an email every time you edit but if they do i&rsquo;m really sorry&mldr; <\/p><p>yeah&mldr; <\/p>",
		"post_date": "2005-08-15 19:26:10",
		"post_date_gmt": "2005-08-15 23:26:10",
		"comment": {
			"comment_content": "haha interesting picturess &mldr; im working on uploading mine also :P",
			"comment_date": "2005-08-21 00:51:00",
			"comment_date_gmt": "2005-08-21 04:51:00",
			"comment_author": "Anonymous"
		}
	},
	{
		"pubDate": "Fri, 29 Jul 2005 17:48:20 -04:00",
		"content": "well, i&rsquo;ve been back for a week from my trip and it wasn&rsquo;t too kablooey (except there were too many rocks - first grand canyon then monument valley then valley of the gods then bryce canyon and many more that i did not pay much attention to!!!) but now the aged p.s are mad at me for reasons that i simply cannot comprehend at this time. oh, and i found out i have attention deficit disorder (otherwise known to normal ppl as add). not much of a surprise as my teachers have been darkly hinting at this for the past four years, but my parents are seriously thinking of drugging me. eew, my sister just found mold in the fridge. but i digress. let us continue my tirade of idiotic ideas. i&rsquo;m surprised people would actually read this nonsense. well, i guess miracles happen. not that this is really a miracle&mldr; i&rsquo;m digressing AGAIN. in case you haven&rsquo;t figured it out, digressing is straying off the subject of a story, paragraph, lecture, or conversation. oh yeah, and on top of that, i have a karate exam today - going for the second highest belt (kinda between brown and black) hmm&mldr; the creation of kushanku&mldr; kushanku is a kata (or set) created by a chinese military officer in 1762. he taught these techniques to okinawans who brought kushanku back to okinawa (a japanese island). kushanku was originally named koshokun, but due to the okinawan language (which has only three vowels - a, i, and u), it became known as kushanku. i think naha-te, tomari-te, and shuri-te are styles of karatedo. i believe naha-te was body-building, shuri-te wasn for small people with quick movements, something related to shaolin kungfu, and tomari-te blended both syles. there, that should cover my test.  my stupid teacher went to a board meeting of the wadokai karatedo federation and all they came out saying was that they agreed karate was different frm karatedo. i mean, really. how weird can they get? well better go now&mldr; ",
		"post_date": "2005-07-29 17:48:20",
		"post_date_gmt": "2005-07-29 21:48:20"
	},
	{
		"pubDate": "Thu, 07 Jul 2005 12:39:26 -04:00",
		"content": "this is for iris&mldr; <span lang='ZH-TW'>&laquo;n¡¤&yen;¡§t&sup2;&Icirc;&Aacute;c&Aring;¨¦>ŽúËùÔÚ ÄÄƒº?? ^_^ not much to say&mldr; <\/span>",
		"post_date": "2005-07-07 12:40:05",
		"post_date_gmt": "2005-07-07 16:40:05"
	},
	{
		"pubDate": "Wed, 29 Jun 2005 17:54:26 -04:00",
		"content": "<p>one more day til our family vacation&mldr; to god knows where&mldr; and i will be stuck in the car with my &ldquo;darling&rdquo; little sister for TEN STRAIGHT HOURS. 😞 why me??? WHY ME??? plus, i lost my cd player and my daddy won&rsquo;t let me bring my boom box&mldr; my sister is ruining my internet time BY CLICKING EVERYWHERE and accidentally deleting my entries!!!!!!!!!! 🤬 gonna kill her so badly SHE DIES. wait, does that make cents?? 🤔 oh well, not that i can think straight ANYWAYS she&rsquo;s making the stupid computer screen go back and forth and making me dizzy&mldr; gonna go and kill her&mldr; i think i&rsquo;m snapping&mldr; farewell&mldr; <\/p>",
		"post_date": "2005-06-29 17:54:26",
		"post_date_gmt": "2005-06-29 21:54:26",
		"comment": [
			{
				"comment_content": "hey gabbie&mldr; its me teffo&mldr; heheh!  me still no internet&mldr; (sniff sniff)",
				"comment_date": "2005-07-03 00:44:00",
				"comment_date_gmt": "2005-07-03 04:44:00",
				"comment_author": "DrAgOnZkIdDoZ"
			},
			{
				"comment_content": "<p>Hiiii, Ms.Gabbie!!!<\/p><p>LoL. Remember me? LoL. [HmM] Hope you&rsquo;re having fun. [^^]<\/p><p>S0o&mldr; you know <strong>Haidee Pang<\/strong>? Like, <strong>0mG!!!<\/strong> I kno her t0o!!!! LoLx.<\/p><p>That&rsquo;s like, <strong>s0o<\/strong> c0ol. [x3]<\/p><p>I&rsquo;m 0uTz.<\/p><p><strong>&lt;3 M<\/strong>r<strong>s. <\/strong>A<strong>k<\/strong>i<strong>r<\/strong>a <strong>K<\/strong>a<strong>g<\/strong>i<strong>m<\/strong>o<strong>t<\/strong>o<\/p>",
				"comment_date": "2005-07-06 00:33:00",
				"comment_date_gmt": "2005-07-06 04:33:00",
				"comment_author": "theOneForgottenKid"
			}
		]
	},
	{
		"pubDate": "Tue, 14 Jun 2005 18:42:48 -04:00",
		"content": "<p>well lessee&mldr; i totally forgot what i wanted to say!!! well&mldr; my sister wus supposed to have a field trip to a beach today, but she had to go to kaiser because she was testing for add AT EIGHT IN THE MORNING and she missed the bus so now i hafta spend ONE WHOLE DAY WITH HER!!! don&rsquo;t laugh, itsh NOT funny!! i see you joanne!!! no laughing!!!<\/p>",
		"post_date": "2005-06-14 16:22:03",
		"post_date_gmt": "2005-06-14 20:22:03",
		"comment": [
			{
				"comment_content": "<p>Hey Gabrielle. I never knew you had a xanga, <\/p><p>-Jenny<\/p>",
				"comment_date": "2005-06-16 13:43:00",
				"comment_date_gmt": "2005-06-16 17:43:00",
				"comment_author": "laminatedbunny"
			},
			{
				"comment_content": "*points and laffs* XD",
				"comment_date": "2005-06-17 01:26:00",
				"comment_date_gmt": "2005-06-17 05:26:00",
				"comment_author": "Kiriku"
			}
		]
	},
	{
		"pubDate": "Mon, 13 Jun 2005 18:22:24 -04:00",
		"content": "<p>my first day of work this summer&mldr; totally annoying. first, i had to input checks and deposits into this computer program called quickbooks and someone made some serious mistakes which caused me to have to spend fifteen minutes fixing the whole thing&mldr; then i tried to scan tax documents into another computer, which totally sucked because the damn program had to be refreshed like ten times. what is up with my dad&rsquo;s office?!? luckily i can work as many hours as i like. during spring break i worked four hours the first day (my dad was pissed that i didn&rsquo;t work more) and eight hours the second day (my dad was pissed that i was so tired). i can&rsquo;t remember how much i worked the rest of the week but i earned enough money to be able to spend one hundred and ten dollars of it. my dad forced me to put all the rest of it and my new year&rsquo;s money into the bank&mldr; agh i&rsquo;m complaining too much.<\/p><p>i got all a&rsquo;s on my finals!!! well, except for mandarin, i got a b+, but I&rsquo;M SO FRIGGIN HAPPY!!! my mom was being annoying again, she was like, &ldquo;why didn&rsquo;t you get ALL a&rsquo;s??&rdquo; well i guess nothing&rsquo;s perfect&mldr; i think i&rsquo;m kinda rambling too much&mldr; <\/p>",
		"post_date": "2005-06-13 18:22:24",
		"post_date_gmt": "2005-06-13 22:22:24"
	},
	{
		"pubDate": "Sun, 12 Jun 2005 18:07:42 -04:00",
		"content": "dude&mldr; peter&rsquo;s party wus kinda lame&mldr; o well&mldr; ",
		"post_date": "2005-06-12 18:07:42",
		"post_date_gmt": "2005-06-12 22:07:42"
	},
	{
		"pubDate": "Fri, 10 Jun 2005 00:56:20 -04:00",
		"content": "<p>LAST DAY OF SKOOL!!!! omg i am SO psyched!! 😂 agh, xc practice is gonna be hard&mldr; o yeh and no more viola lessons!! soooooooooo happy&mldr; well i&rsquo;m kinda tired so i can&rsquo;t say anything too intelligent&mldr; o yes jojo and tiff and iris DON&rsquo;T forget to finish the book so i can give it to jojo before she leaves, okay?? good!! can&rsquo;t wait for next week&mldr; <\/p>",
		"post_date": "2005-06-10 00:56:20",
		"post_date_gmt": "2005-06-10 04:56:20",
		"comment": {
			"comment_content": "<p>how do u know joanna?? awesome!!!!! ^_^<\/p><p>peter&rsquo;s party was a bore, but i will miss him&mldr; sniff sniff..lolz<\/p>",
			"comment_date": "2005-06-12 02:20:00",
			"comment_date_gmt": "2005-06-12 06:20:00",
			"comment_author": "hardcandylover"
		}
	},
	{
		"pubDate": "Thu, 02 Jun 2005 23:55:05 -04:00",
		"content": "<p>well&mldr; i made a weirdo quiz&mldr; .well here goes&mldr; <a href='http://www.quizyourfriends.com/takequiz.php?quizname=050602234711-186339' target='_new'>Take<\/a>. yeh well good luck on this stupid quiz!!!<\/p><p>well today was cool&mldr; i got a ninety-five on my great expectations finals!! O YEH! second-best in the class&mldr; except now everyone is calling me a nerd&mldr; yup. during lunch we were yet again playing with the jian zi (anyone getting tired of it yet?) and my stoopid big shoes made me slide so far that i looked like i was doing a matrix neo thingy&mldr; well&mldr; bie.<\/p>",
		"post_date": "2005-06-02 23:55:05",
		"post_date_gmt": "2005-06-03 03:55:05"
	},
	{
		"pubDate": "Sat, 28 May 2005 11:44:09 -04:00",
		"content": "<p>i&rsquo;m at family camp right now&mldr; the food kinda sucks and i&rsquo;m really hyper for no reason at all&mldr; i finally found the computer after looking for it for fifteen friggin minutes!! agh, i hafta take care of my lil sister for THREE WHOLE DAYS without my parents!!! it&rsquo;s like crybabies but ten times worse!! lol maria just subscribed to me and i feel ridiculously happy&mldr; i&rsquo;m such a dork. i&rsquo;m typing from my email cause i&rsquo;m only supposed to go on email here so i hope it works!! everyone&rsquo;s xangas look so pretty and mine is really weird&mldr; o well i am weird so it sort of describes me&mldr; <\/p><p>i&rsquo;m suposed to write a whole page in alvin&rsquo;s yearbook and i have no idea what to write and my handwriting&rsquo;s hella small!! well my fifteen minutes is up so i will be signing off&mldr; <\/p>",
		"post_date": "2005-05-28 11:44:09",
		"post_date_gmt": "2005-05-28 15:44:09",
		"comment": {
			"comment_content": "<p>Have fun in camp! b^-^d<\/p>",
			"comment_date": "2005-05-28 19:07:00",
			"comment_date_gmt": "2005-05-28 23:07:00",
			"comment_author": "Kiriku"
		}
	},
	{
		"pubDate": "Fri, 20 May 2005 20:52:58 -04:00",
		"content": "yay, tiff changed the dates!!!!! XD",
		"post_date": "2005-05-20 20:52:58",
		"post_date_gmt": "2005-05-21 00:52:58",
		"comment": [
			{
				"comment_content": "Hii!!! Are you Gabbie from Youth Rally yesterday? ^^",
				"comment_date": "2005-05-22 01:27:00",
				"comment_date_gmt": "2005-05-22 05:27:00",
				"comment_author": "theOneForgottenKid"
			},
			{
				"comment_content": "hey, do i know u??or is this just random subscriptions??^_^",
				"comment_date": "2005-05-25 02:37:00",
				"comment_date_gmt": "2005-05-25 06:37:00",
				"comment_author": "hardcandylover"
			},
			{
				"comment_content": "<p>:D ¼Ò±È!!  ÄãºÃ! ^-^<\/p>",
				"comment_date": "2005-05-28 02:38:00",
				"comment_date_gmt": "2005-05-28 06:38:00",
				"comment_author": "Kiriku"
			}
		]
	},
	{
		"pubDate": "Fri, 20 May 2005 20:52:04 -04:00",
		"content": "hey&mldr; i&rsquo;m at tiff&rsquo;s house&mldr; school was weird today, i thought we were gonna get slaughtered by the soccer team but we didn&rsquo;t have to. whew!!! o yes, on wednesday we were slaughtered IN OUR OWN SPORT by the soccer team. not fair! they&rsquo;re bigger and older and they know more!!! and the hockey class (aka us) have mostly eighth graders and only six ninth graders!!! no offense to any eighth graders&mldr; WE SUCK!!! BOO-YA!!! okay, being a LITTLE weird now&mldr; buh bie",
		"post_date": "2005-05-20 20:52:04",
		"post_date_gmt": "2005-05-21 00:52:04"
	},
	{
		"pubDate": "Tue, 17 May 2005 01:59:05 -04:00",
		"content": "today zack joined our game of hackysack and kicked it into the dump. then peter did the same thing. ai yah, soon we&rsquo;ll be kicking it everywhere. i think everyone is a little too ADDICTED to this stupid sport (if you can call it that)&mldr; but who listens to me anyways? oh well&mldr; ",
		"post_date": "2005-05-17 01:59:05",
		"post_date_gmt": "2005-05-17 05:59:05"
	},
	{
		"pubDate": "Fri, 13 May 2005 20:14:56 -04:00",
		"content": "xanga gets all the dates and times mixed up!!! oh well&mldr; not fair, the physics class got to go to great america!! well, the ppl left behind did get ice creme&mldr; but still!!! guess i&rsquo;m feeling angry today&mldr; oh yes, i got a really really good kick for the hackysack thingy&mldr; i think its called jian zi. *sniff sniff* larry is telling everyone INCLUDING ME that we&rsquo;re&mldr; SLIPPING!! shock! the horror!",
		"post_date": "2005-05-13 20:14:56",
		"post_date_gmt": "2005-05-14 00:14:56",
		"comment": {
			"comment_content": "<p>Hii!!!! I think your xanga looks very pretty. ^_^<\/p><p>~Akira<\/p>",
			"comment_date": "2005-05-14 18:44:00",
			"comment_date_gmt": "2005-05-14 22:44:00",
			"comment_author": "theOneForgottenKid"
		}
	},
	{
		"pubDate": "Fri, 13 May 2005 00:22:09 -04:00",
		"content": "today was very tiring and really annoying&mldr; the algebra quiz was hella easy, i think most people agree with me. now THAT sounds just plain arrogant. oh wells&mldr; i SUCK at hackysack. we played it with that feather thingy and i missed sooooooooo many times. plus i can&rsquo;t draw any more. at least i can still write pretty!! 😂 well&mldr; not much to talk about, buh bie",
		"post_date": "2005-05-13 00:22:09",
		"post_date_gmt": "2005-05-13 04:22:09"
	},
	{
		"pubDate": "Wed, 11 May 2005 01:15:40 -04:00",
		"content": "hey&mldr; this is my first time for xanga&mldr; okay that sounds REALLY dumb but i don&rsquo;t care&mldr; 😂 have a nice day/night whoever you are&mldr; ",
		"post_date": "2005-05-11 01:15:40",
		"post_date_gmt": "2005-05-11 05:15:40",
		"comment": {
			"comment_content": "<p>Hi!!! Welcome to Xanga!!!! Have fun posting&mldr; you get surprise comments like these once in a blue moon. LoL. Bye bye and again, welcome to Xanga!!! &lt;3<\/p><p><strong>Akira<\/strong><\/p>",
			"comment_date": "2005-05-11 21:34:00",
			"comment_date_gmt": "2005-05-12 01:34:00",
			"comment_author": "theOneForgottenKid"
		}
	}
]